# **1965. Employees With Missing Information**
``` console
Table: Employees

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| employee_id | int     |
| name        | varchar |
+-------------+---------+
employee_id is the column with unique values for this table.
Each row of this table indicates the name of the employee whose ID is employee_id.
 

Table: Salaries

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| employee_id | int     |
| salary      | int     |
+-------------+---------+
employee_id is the column with unique values for this table.
Each row of this table indicates the salary of the employee whose ID is employee_id.
 

Write a solution to report the IDs of all the employees with missing information. The information of an employee is missing if:

The employee's name is missing, or
The employee's salary is missing.
Return the result table ordered by employee_id in ascending order.

The result format is in the following example.

 

Example 1:

Input: 
Employees table:
+-------------+----------+
| employee_id | name     |
+-------------+----------+
| 2           | Crew     |
| 4           | Haven    |
| 5           | Kristian |
+-------------+----------+
Salaries table:
+-------------+--------+
| employee_id | salary |
+-------------+--------+
| 5           | 76071  |
| 1           | 22517  |
| 4           | 63539  |
+-------------+--------+
Output: 
+-------------+
| employee_id |
+-------------+
| 1           |
| 2           |
+-------------+
Explanation: 
Employees 1, 2, 4, and 5 are working at this company.
The name of employee 1 is missing.
The salary of employee 2 is missing.
```

**Solution-1:**

``` sql
SELECT employee_id
FROM
(SELECT a.employee_id,a.name, b.salary
FROM Employees a
LEFT JOIN Salaries b ON a.employee_id = b.employee_id
UNION
SELECT b.employee_id, a.name, b.salary
FROM Employees a
RIGHT JOIN Salaries b ON a.employee_id = b.employee_id)a
WHERE name is null or Salary is null
ORDER BY employee_id;

**Solution-2:**

``` sql
--Postgres SQL
SELECT employee_id
FROM Employees FULL JOIN Salaries USING(employee_id)
WHERE name IS NULL OR salary IS NULL;

**Solution-3:**

``` sql
# Write your MySQL query statement below
select Employees.employee_id from Employees natural left join Salaries 
where Salaries.salary is null
union 
select Salaries.employee_id from salaries natural left join Employees 
where Employees.name is null
order by employee_id;

**Solution-4:**

``` sql
SELECT T.employee_id
FROM  
  (SELECT * FROM Employees LEFT JOIN Salaries USING(employee_id)
   UNION 
   SELECT * FROM Employees RIGHT JOIN Salaries USING(employee_id))
AS T
WHERE T.salary IS NULL OR T.name IS NULL
ORDER BY employee_id;

**Solution-5:**

``` sql
SELECT employee_id FROM Employees WHERE employee_id NOT IN (SELECT employee_id FROM Salaries)
UNION 
SELECT employee_id FROM Salaries WHERE employee_id NOT IN (SELECT employee_id FROM Employees)
ORDER BY 1 ASC